zephyrproject-rtos/hal_microchip/packs/pic32c/pic32cm_pl/pic32cm_pl10/include/pio/pic32cm6408pl10028.h
#define PIN_PA07A_EIC_NMI                          _UINT32_(7) 
#define MUX_PA07A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PA07A_EIC_NMI                       ((PIN_PA07A_EIC_NMI << 16) | MUX_PA07A_EIC_NMI)
#define PORT_PA07A_EIC_NMI                         (_UINT32_(1) << 7)

#define PIN_PA30A_EIC_NMI                          _UINT32_(30)
#define MUX_PA30A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PA30A_EIC_NMI                       ((PIN_PA30A_EIC_NMI << 16) | MUX_PA30A_EIC_NMI)
#define PORT_PA30A_EIC_NMI                         (_UINT32_(1) << 30)

/* ================== PORT definition for GCLK peripheral =================== */
#define PIN_PA07I_GCLK_IO0                         _UINT32_(7) 
#define MUX_PA07I_GCLK_IO0                         _UINT32_(8) 
#define PINMUX_PA07I_GCLK_IO0                      ((PIN_PA07I_GCLK_IO0 << 16) | MUX_PA07I_GCLK_IO0)
#define PORT_PA07I_GCLK_IO0                        (_UINT32_(1) << 7)

#define PIN_PA23I_GCLK_IO0                         _UINT32_(23)
#define MUX_PA23I_GCLK_IO0                         _UINT32_(8) 
#define PINMUX_PA23I_GCLK_IO0                      ((PIN_PA23I_GCLK_IO0 << 16) | MUX_PA23I_GCLK_IO0)
#define PORT_PA23I_GCLK_IO0                        (_UINT32_(1) << 23)

#define PIN_PA31I_GCLK_IO0                         _UINT32_(31)
#define MUX_PA31I_GCLK_IO0                         _UINT32_(8) 
#define PINMUX_PA31I_GCLK_IO0                      ((PIN_PA31I_GCLK_IO0 << 16) | MUX_PA31I_GCLK_IO0)
#define PORT_PA31I_GCLK_IO0                        (_UINT32_(1) << 31)

#define PIN_PA03I_GCLK_IO0                         _UINT32_(3) 
#define MUX_PA03I_GCLK_IO0                         _UINT32_(8) 
#define PINMUX_PA03I_GCLK_IO0                      ((PIN_PA03I_GCLK_IO0 << 16) | MUX_PA03I_GCLK_IO0)
#define PORT_PA03I_GCLK_IO0                        (_UINT32_(1) << 3)

#define PIN_PA04I_GCLK_IO1                         _UINT32_(4) 
#define MUX_PA04I_GCLK_IO1                         _UINT32_(8) 
#define PINMUX_PA04I_GCLK_IO1                      ((PIN_PA04I_GCLK_IO1 << 16) | MUX_PA04I_GCLK_IO1)
#define PORT_PA04I_GCLK_IO1                        (_UINT32_(1) << 4)

#define PIN_PA08I_GCLK_IO1                         _UINT32_(8) 
#define MUX_PA08I_GCLK_IO1                         _UINT32_(8) 
#define PINMUX_PA08I_GCLK_IO1                      ((PIN_PA08I_GCLK_IO1 << 16) | MUX_PA08I_GCLK_IO1)
#define PORT_PA08I_GCLK_IO1                        (_UINT32_(1) << 8)

#define PIN_PA11I_GCLK_IO1                         _UINT32_(11)
#define MUX_PA11I_GCLK_IO1                         _UINT32_(8) 
#define PINMUX_PA11I_GCLK_IO1                      ((PIN_PA11I_GCLK_IO1 << 16) | MUX_PA11I_GCLK_IO1)
#define PORT_PA11I_GCLK_IO1                        (_UINT32_(1) << 11)

#define PIN_PA22I_GCLK_IO1                         _UINT32_(22)
#define MUX_PA22I_GCLK_IO1                         _UINT32_(8) 
#define PINMUX_PA22I_GCLK_IO1                      ((PIN_PA22I_GCLK_IO1 << 16) | MUX_PA22I_GCLK_IO1)
#define PORT_PA22I_GCLK_IO1                        (_UINT32_(1) << 22)

#define PIN_PA24I_GCLK_IO1                         _UINT32_(24)
#define MUX_PA24I_GCLK_IO1                         _UINT32_(8) 
#define PINMUX_PA24I_GCLK_IO1                      ((PIN_PA24I_GCLK_IO1 << 16) | MUX_PA24I_GCLK_IO1)
#define PORT_PA24I_GCLK_IO1                        (_UINT32_(1) << 24)

#define PIN_PA00I_GCLK_IO1                         _UINT32_(0) 
#define MUX_PA00I_GCLK_IO1                         _UINT32_(8) 
#define PINMUX_PA00I_GCLK_IO1                      ((PIN_PA00I_GCLK_IO1 << 16) | MUX_PA00I_GCLK_IO1)
#define PORT_PA00I_GCLK_IO1                        (_UINT32_(1) << 0)

#define PIN_PA05I_GCLK_IO2                         _UINT32_(5) 
#define MUX_PA05I_GCLK_IO2                         _UINT32_(8) 
#define PINMUX_PA05I_GCLK_IO2                      ((PIN_PA05I_GCLK_IO2 << 16) | MUX_PA05I_GCLK_IO2)
#define PORT_PA05I_GCLK_IO2                        (_UINT32_(1) << 5)

#define PIN_PA09I_GCLK_IO2                         _UINT32_(9) 
#define MUX_PA09I_GCLK_IO2                         _UINT32_(8) 
#define PINMUX_PA09I_GCLK_IO2                      ((PIN_PA09I_GCLK_IO2 << 16) | MUX_PA09I_GCLK_IO2)
#define PORT_PA09I_GCLK_IO2                        (_UINT32_(1) << 9)

#define PIN_PA20I_GCLK_IO2                         _UINT32_(20)
#define MUX_PA20I_GCLK_IO2                         _UINT32_(8) 
#define PINMUX_PA20I_GCLK_IO2                      ((PIN_PA20I_GCLK_IO2 << 16) | MUX_PA20I_GCLK_IO2)
#define PORT_PA20I_GCLK_IO2                        (_UINT32_(1) << 20)

#define PIN_PA25I_GCLK_IO2                         _UINT32_(25)
#define MUX_PA25I_GCLK_IO2                         _UINT32_(8) 
#define PINMUX_PA25I_GCLK_IO2                      ((PIN_PA25I_GCLK_IO2 << 16) | MUX_PA25I_GCLK_IO2)
#define PORT_PA25I_GCLK_IO2                        (_UINT32_(1) << 25)

#define PIN_PA01I_GCLK_IO2                         _UINT32_(1) 
#define MUX_PA01I_GCLK_IO2                         _UINT32_(8) 
#define PINMUX_PA01I_GCLK_IO2                      ((PIN_PA01I_GCLK_IO2 << 16) | MUX_PA01I_GCLK_IO2)
#define PORT_PA01I_GCLK_IO2                        (_UINT32_(1) << 1)

#define PIN_PA02I_GCLK_IO3                         _UINT32_(2) 
#define MUX_PA02I_GCLK_IO3                         _UINT32_(8) 
#define PINMUX_PA02I_GCLK_IO3                      ((PIN_PA02I_GCLK_IO3 << 16) | MUX_PA02I_GCLK_IO3)
#define PORT_PA02I_GCLK_IO3                        (_UINT32_(1) << 2)

#define PIN_PA06I_GCLK_IO3                         _UINT32_(6) 
#define MUX_PA06I_GCLK_IO3                         _UINT32_(8) 
#define PINMUX_PA06I_GCLK_IO3                      ((PIN_PA06I_GCLK_IO3 << 16) | MUX_PA06I_GCLK_IO3)
#define PORT_PA06I_GCLK_IO3                        (_UINT32_(1) << 6)

#define PIN_PA10I_GCLK_IO3                         _UINT32_(10)
#define MUX_PA10I_GCLK_IO3                         _UINT32_(8) 
#define PINMUX_PA10I_GCLK_IO3                      ((PIN_PA10I_GCLK_IO3 << 16) | MUX_PA10I_GCLK_IO3)
#define PORT_PA10I_GCLK_IO3                        (_UINT32_(1) << 10)

#define PIN_PA21I_GCLK_IO3                         _UINT32_(21)
#define MUX_PA21I_GCLK_IO3                         _UINT32_(8) 
#define PINMUX_PA21I_GCLK_IO3                      ((PIN_PA21I_GCLK_IO3 << 16) | MUX_PA21I_GCLK_IO3)
#define PORT_PA21I_GCLK_IO3                        (_UINT32_(1) << 21)

/* =================== PORT definition for PTC peripheral =================== */
#define PIN_PA02P_PTC_PAD2                         _UINT32_(2) 
#define MUX_PA02P_PTC_PAD2                         _UINT32_(15)
#define PINMUX_PA02P_PTC_PAD2                      ((PIN_PA02P_PTC_PAD2 << 16) | MUX_PA02P_PTC_PAD2)
#define PORT_PA02P_PTC_PAD2                        (_UINT32_(1) << 2)

#define PIN_PA03P_PTC_PAD3                         _UINT32_(3) 
#define MUX_PA03P_PTC_PAD3                         _UINT32_(15)
#define PINMUX_PA03P_PTC_PAD3                      ((PIN_PA03P_PTC_PAD3 << 16) | MUX_PA03P_PTC_PAD3)
#define PORT_PA03P_PTC_PAD3                        (_UINT32_(1) << 3)

#define PIN_PA04P_PTC_PAD4                         _UINT32_(4) 
#define MUX_PA04P_PTC_PAD4                         _UINT32_(15)
#define PINMUX_PA04P_PTC_PAD4                      ((PIN_PA04P_PTC_PAD4 << 16) | MUX_PA04P_PTC_PAD4)
#define PORT_PA04P_PTC_PAD4                        (_UINT32_(1) << 4)

